# NumULines Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGrid..::..NumULines Property
CurtainGrid Class See Also
---
Get the number of grid lines in the U direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int NumULines { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumULines As Integer
	Get
```

Visual C++
---
```text
public:
property int NumULines {
	int get ();
}
```

# See Also
CurtainGrid Class
Autodesk.Revit.DB Namespace